vanhao-hub/usb_key_authen/src/core/mcxa156/sdks/frdm_mcxa156_sdk/components/video/display/it6161/fsl_it6161.c
    {0xF8, 0xFF, 0xC3},
    {0xF8, 0xFF, 0xA5},
    {0xF4, 0x0C, 0x00},
    {0xF3, 0x02, 0x00},
    {0xF8, 0xFF, 0xFF},

    {0x5A, 0x0C, 0x0C},
    {HDMI_TX_HDMI_CONTROL_REGD1, HDMI_TX_HDMI_CONTROL_REGD1_RegStableDbgMd_MASK,
     (FORCE_TXCLK_STABLE << 3) | (STABLE_LINEPIEXELCNT_SENSITIVITY << 1)},
    {HDMI_TX_CLOCK_CONTROL_REG5D, 0x04, (RCLK_FREQ_SEL << 2)}, /* Cannot find it from it6161 programming guide */
    {0x65, 0x03, 0x00},
    {0x71, 0xF9,
     0x18}, /* XP_Lock stable time: 00: 75us; check XP_lock for TX fifo reset: 0: disable; reset TX fifo when PLL
               unlock: 0: disable; TX fifo auto reset enable: 1: enable; TX fifo manual reset: 0: disable */
    {0xCF, 0xFF, 0x00}, /* packet blan guard band option: 00: +4; packet limit guard band option: 00: +32; packet keep
                           out guard band option: 00: +8; guard band for packet transmission in blank period: 0:
                           disable; guard band for packet transmission in limit period: 0: disable */
    {0xD1, 0x02, 0x00}, /* stable linepixelcnt sensitivity: 0: low sensitivity */

    {0x59, 0xD0, 0x40}, /* VCLK frequncy depends on REGManualPLLPR when REGDisLockPR=1: 01: 2x; 0: internal pixel clock
                           frequency depends on pixel repetition factor in AVI infoframe */
    {0xE1, 0x20, 0x00}, /* 0: use rising edge to sample WS and I2S */
    {0xF5, 0x40, 0x00}, /* cannot find the field from it6161 programming guide */
    {0x05, 0xC0, 0x40}, /* 0: INT active low; 1: Open-Drain mode */
    {0x0C, 0xFF, 0xFF}, /* Clear the interrupt */
    {0x0D, 0xFF, 0x00}, /* Don't know what's meaning? */
    {0x0E, 0x02, 0x00}, /* Clear AduCTS interrupt? unsure */

    {0x0C, 0xFF, 0x00},
    {0x0D, 0xFF, 0x00},
    {0x0E, 0x02, 0x00},
    {0x20, 0x01, 0x00},
};

static RegSetTable_t HDMITX_PwrOn_Table[] = {
    /* PwrOn RCLK , IACLK ,TXCLK */
    {0x0F, 0x70, 0x00},
    /* PLL PwrOn */
    /* PwrOn DRV */
    {0x61, 0x20, 0x00},
    /* PwrOn XPLL */
    {0x62, 0x44, 0x00},
    /* PwrOn IPLL */
    {0x64, 0x40, 0x00},
    /* PLL Reset OFF */
    /* DRV_RST */
    {0x61, 0x10, 0x00},
    /* XP_RESETB */
    {0x62, 0x08, 0x08},
    /* IP_RESETB */
    {0x64, 0x04, 0x04},
};

void it6161_HDMITX_Init(display_handle_t *handle)
{
    HDMITX_LoadRegSetting(handle, HDMITX_Init_Table, sizeof(HDMITX_Init_Table));
    HDMITX_LoadRegSetting(handle, HDMITX_PwrOn_Table, sizeof(HDMITX_PwrOn_Table));
}

static void it6161_MIPIRX_Init(display_handle_t *handle)
{
    it6161_MIPIRX_CONF(handle);
    /* Enable MIPI RX clock domain */
    MIPIRX_SetI2C_Byte(handle, MIPI_RX_SOFT_RESET_REG05,
                       MIPI_RX_SOFT_RESET_REG05_RegSoftORst_MASK | MIPI_RX_SOFT_RESET_REG05_RegSoftMRst_MASK, 0x00U);
}

void it6161_SetIntActiveLevel(display_handle_t *handle, enum it6161_active_level level)
{
    MIPIRX_SetI2C_Byte(
        handle, MIPI_RX_SYS_CONF_REG0D, MIPI_RX_SYS_CONF_REG0D_REGINTPOL_MASK,
        ((level == HIGH_LVL) ? (MIPI_RX_SYS_CONF_REG0D_REGINTPOL(0x01U)) : (MIPI_RX_SYS_CONF_REG0D_REGINTPOL(0x00U))));
    HDMITX_SetI2C_Byte(
        handle, HDMI_TX_GENERAL_REG05, HDMI_TX_GENERAL_REG05_REGINTPOL_MASK | HDMI_TX_GENERAL_REG05_REGINTIOMODE_MASK,
        ((level == HIGH_LVL) ? (HDMI_TX_GENERAL_REG05_REGINTPOL(0x01U) | HDMI_TX_GENERAL_REG05_REGINTIOMODE(0x00U)) :
                               (HDMI_TX_GENERAL_REG05_REGINTPOL(0x00U) | HDMI_TX_GENERAL_REG05_REGINTIOMODE(0x01U))));
}
void it6161_IntMaskEnable(display_handle_t *handle)
{
    MIPIRX_SetI2C_Byte(handle, MIPI_RX_SYS_STATUS_REG0F, 0x03U,
                       0x00U); /* Cannot find relative information about these fields from it6161 programming guide */

    MIPIRX_WriteI2C_Byte(handle, MIPI_RX_INT_MASK_REG09,
                         MIPI_RX_INT_MASK_REG09_REnPPSMVidStbChgInt | MIPI_RX_INT_MASK_REG09_REnPPSPVidStbChgInt);
    MIPIRX_WriteI2C_Byte(handle, MIPI_RX_INT_MASK_REG0A,
                         MIPI_RX_INT_MASK_REG0A_REnPPGVidStbChgInt | MIPI_RX_INT_MASK_REG0A_REnPPSDByteErrInt |
                             MIPI_RX_INT_MASK_REG0A_REnCMOffInt | MIPI_RX_INT_MASK_REG0A_REnCMOnInt |
                             MIPI_RX_INT_MASK_REG0A_REnShutDoneInt | MIPI_RX_INT_MASK_REG0A_REnTurnOnInt);
    // MIPI_RX_INT_MASK_REG0A_REnFIFOOvRdInt | MIPI_RX_INT_MASK_REG0A_REnFIFOOvWrInt);
    // MIPI_RX_INT_MASK_REG0A_REnFIFOOvRdInt);

    MIPIRX_WriteI2C_Byte(handle, MIPI_RX_INT_MASK_REG0B,
                         MIPI_RX_INT_MASK_REG0B_REnECC1bErrInt | MIPI_RX_INT_MASK_REG0B_REnECC2bErrInt |
                             MIPI_RX_INT_MASK_REG0B_REnLMFIFOErrInt | MIPI_RX_INT_MASK_REG0B_REnCRCErrInt |
                             MIPI_RX_INT_MASK_REG0B_REnMCLKOffInt | MIPI_RX_INT_MASK_REG0B_REnPPIFifoOvWrInt);

    /* select bank0, 0x00~0xff */
    HDMITX_SetI2C_Byte(handle, HDMI_TX_SYS_STATUS_REG0F, HDMI_TX_SYS_STATUS_REG0F_REGBANKSEL_MASK,
                       HDMI_TX_SYS_STATUS_REG0F_REGBANKSEL(0x00U));
    HDMITX_WriteI2C_Byte(handle, HDMI_TX_INT_MASK_REG09,
                         HDMI_TX_INT_MASK_REG09_REG_AudioOvFlw(0x00U) | HDMI_TX_INT_MASK_REG09_REG_DDCNoACK(0x00U) |
                             HDMI_TX_INT_MASK_REG09_REG_DDCFIFOErr(0x00U) |
                             HDMI_TX_INT_MASK_REG09_REG_DDCBusHang(0x00U) | HDMI_TX_INT_MASK_REG09_REG_RxSEN(0x00U) |
                             HDMI_TX_INT_MASK_REG09_REG_HPD(0x00U));
    HDMITX_SetI2C_Byte(handle, HDMI_TX_INT_MASK_REG0B, HDMI_TX_INT_MASK_REG0B_REG_VidStable_MASK,
                       HDMI_TX_INT_MASK_REG0B_REG_VidStable(0x00U));
}

status_t IT6161_Init(display_handle_t *handle, const display_config_t *config)
{
    status_t status;

    assert(handle);

    status = IT6161_Identify(handle);
    if (kStatus_Success != status)
    {
        return status;
    }

    it6161.mipi_rx.hs_settle_num                   = 0x01U;
    it6161.mipi_rx.hs_trailing_skip_stage          = 0x04U;
    it6161.mipi_rx.enable_sync_bit_error_tolerance = 0x00U;
    it6161.mipi_rx.enable_multi_lane_deskew        = 0x01U;
    it6161.mipi_rx.force_continuous_clock_mode     = 0x01U;
    it6161.mipi_rx.ppi_debug_selection             = 0x0CU;
    it6161.mipi_rx.ignore_null_packet              = 0x01U;
    it6161.mipi_rx.ignore_blank_packet             = 0x01U;
    it6161.mipi_rx.enable_dummy_ecc_error          = 0x00U;
    it6161.mipi_rx.sel_eotp                        = 0x00U;
    it6161.mipi_rx.lm_debug_selection              = 0x00U;

    it6161.mipi_rx.auto_sync_falling   = 0x01U;
    it6161.mipi_rx.interlaced_mode     = 0x00U;
    it6161.mipi_rx.user_define_timming = 0x00U;
    it6161.mipi_rx.prec_update         = PREC_UPDATE;
    it6161.mipi_rx.mrec_update         = MREC_UPDATE;

    it6161.mipi_rx.v_timing_resync_selction              = 0x01U;
    it6161.mipi_rx.enable_v_timing_resync_enhance_mode   = 0x00U;
    it6161.mipi_rx.enable_frame_resync                   = 0x00U;
    it6161.mipi_rx.pps_fifo_read_start_point             = 0x04U;
    it6161.mipi_rx.enable_h_timing_resync                = 0x00U;
    it6161.mipi_rx.enable_v_timing_resync                = 0x00U;
    it6161.mipi_rx.enable_fifo_auto_reset                = 0x01U;
    it6161.mipi_rx.enable_overflow_auto_reset            = 0x00U;
    it6161.mipi_rx.enable_mclk_horizontal_average        = 0x01U;
    it6161.mipi_rx.allowable_mclk_horizontal_shift_value = 0x08U;
    it6161.mipi_rx.allowable_pclk_horizontal_shift_value = 0x03U;
    it6161.mipi_rx.enable_external_pclk                  = 0x00U;
    it6161.mipi_rx.bypass_through_mode                   = EN_MIPIRX_BYPASS_MODE;
    it6161.mipi_rx.enable_ttl_tx_crc                     = 0x01U;
    it6161.mipi_rx.crc_frame_number                      = 0x20U;

    it6161.mipi_rx.mipirx_lane_swap = 0x00U;
    it6161.mipi_rx.mipirx_dpdn_swap = 0x00U;
    it6161.mipi_rx.lanes            = config->dsiLanes;
    it6161.mipi_rx.inverse_mclk     = 0x01U;

