vanhao-hub/usb_key_authen/src/core/mcxa156/sdks/frdm_mcxa156_sdk/components/video/display/it6161/fsl_it6161.c
    it6161.hdmi_tx.hdmitx_bypass_mode       = EN_HDMITX_BYPASS_MODE;
    it6161.hdmi_tx.tx_clk_stable            = FORCE_TX_CLK_STABLE;
    it6161.hdmi_tx.tx_vid_stable            = FORCE_TX_VID_STABLE;
    it6161.hdmi_tx.de_generation_enable     = 0x00U; /* The DE input received are used for HDMI output */
    it6161.hdmi_tx.vertical_sync_polarity   = V_SYNC_POL;
    it6161.hdmi_tx.horizontal_sync_polarity = H_SYNC_POL;
    it6161.hdmi_tx.de_only_in               = 0x01U;

    /* Use these arguments to generate hdmi blank timing */
    it6161.hdmi_tx.mode.hdisplay    = FSL_VIDEO_EXTRACT_WIDTH(config->resolution);
    it6161.hdmi_tx.mode.hsync_start = FSL_VIDEO_EXTRACT_WIDTH(config->resolution) + config->hfp;
    it6161.hdmi_tx.mode.hsync_end   = FSL_VIDEO_EXTRACT_WIDTH(config->resolution) + config->hfp + config->hsw;
    it6161.hdmi_tx.mode.htotal = FSL_VIDEO_EXTRACT_WIDTH(config->resolution) + config->hfp + config->hsw + config->hbp;
    it6161.hdmi_tx.mode.vdisplay    = FSL_VIDEO_EXTRACT_HEIGHT(config->resolution);
    it6161.hdmi_tx.mode.vsync_start = FSL_VIDEO_EXTRACT_HEIGHT(config->resolution) + config->vfp;
    it6161.hdmi_tx.mode.vsync_end   = FSL_VIDEO_EXTRACT_HEIGHT(config->resolution) + config->vfp + config->vsw;
    it6161.hdmi_tx.mode.vtotal = FSL_VIDEO_EXTRACT_HEIGHT(config->resolution) + config->vfp + config->vsw + config->vbp;
    it6161.hdmi_tx.support_audio = HDMI_TX_SUPPORT_AUDIO;
    if (it6161.hdmi_tx.support_audio != 0x0U)
    {
        it6161.hdmi_tx.output_channel          = HDMI_TX_OUTPUT_CHANNEL;
        it6161.hdmi_tx.input_audio_type        = HDMI_TX_INPUT_AUDIO_TYPE;
        it6161.hdmi_tx.input_audio_interface   = (uint8_t)HDMI_TX_INPUT_AUDIO_INTERFACE;
        it6161.hdmi_tx.input_audio_sample_freq = HDMI_TX_INPUT_AUDIO_SAMPLE_FREQ;
    }
    it6161.hdmi_tx.pclk_div2 = HDMI_TX_PCLK_DIV2;

    it6161_MIPIRX_Init(handle);
    it6161_HDMITX_Init(handle);
    /* set it6161's active level as high level */
    it6161_SetIntActiveLevel(handle, HIGH_LVL);

    it6161_IntMaskEnable(handle);

    return status;
}

status_t IT6161_Deinit(display_handle_t *handle)
{
    return kStatus_Success;
}

status_t IT6161_Start(display_handle_t *handle)
{
    return kStatus_Success;
}

status_t IT6161_Stop(display_handle_t *handle)
{
    return kStatus_Success;
}

void IT6161_Interrupt(display_handle_t *handle)
{
    MIPIRX_DevLoopProc(handle);
    HDMITX_DevLoopProc(handle);
}
